import pandas as pd
from IPython.display import display

# 첫 번째 데이터프레임
districts1 = ['합계', '종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구', '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구', '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구']
total_waste1 = [48036.0, 1149.1, 1154.0, 1557.1, 3641.8, 1209.2, 1829.1, 1350.3, 1681.8, 988.5, 907.5, 1076.4, 1298.8, 981.4, 1394.2, 1086.5, 4947.8, 1215.3, 1347.2, 1911.4, 1013.8, 1729.2, 4382.9, 4194.1, 3008.0, 2980.3]
recycling_amount1 = [41615.2, 1040.9, 989.3, 1444.9, 3205.0, 1128.1, 1712.9, 1231.3, 1583.5, 903.4, 800.2, 893.3, 1146.8, 872.3, 1063.0, 916.3, 2820.9, 995.6, 1203.4, 1758.6, 912.1, 1567.3, 4171.2, 3731.0, 2709.5, 2814.2]

# 두 번째 데이터프레임
total_waste2 = [8396.1, 160.6, 219.7, 231.5, 195.2, 167.8, 227.0, 204.2, 285.9, 194.4, 179.8, 256.7, 301.0, 204.2, 467.2, 264.7, 1929.7, 291.4, 214.7, 310.2, 217.0, 308.7, 337.9, 447.3, 494.1, 285.3]
recycling_amount2 = [3627.7, 55.2, 58.8, 125.1, 110.2, 89.1, 113.7, 91.8, 188.9, 110.6, 74.4, 146.2, 150.9, 97.4, 140.4, 148.8, 453.2, 128.8, 115.0, 175.6, 116.6, 149.0, 150.8, 210.6, 275.0, 151.5]

# 세 번째 데이터프레임
food_waste = {'음식물폐기물 발생량': [2456.8, 69.2, 78.5, 62.1, 76.7, 82.7, 93.2, 84.1, 86.7, 64.2, 72.1, 115.7, 77.9, 61.0, 78.0, 88.4, 130.0, 81.8, 55.5, 131.5, 80.5, 91.7, 147.4, 232.2, 199.6, 116.4],
    '음식물폐기물 재활용량': [2456.8, 69.2, 78.5, 62.1, 76.7, 82.7, 93.2, 84.1, 86.7, 64.2, 72.1, 115.7, 77.9, 61.0, 78.0, 88.4, 130.0, 81.8, 55.5, 131.5, 80.5, 91.7, 147.4, 232.2, 199.6, 116.4]
}

# 첫 번째 데이터프레임 생성
df1 = pd.DataFrame({'지역': districts1, '발생량': total_waste1, '재활용량': recycling_amount1})

# 두 번째 데이터프레임 생성
df2 = pd.DataFrame({'생활폐기물발생량': total_waste2, '생활폐기물재활용량': recycling_amount2})

# 세 번째 데이터프레임 생성
df3 = pd.DataFrame(food_waste)

# 데이터프레임 합치기
df = pd.concat([df1, df2, df3], axis=1)

# 출력 포맷 조정
pd.set_option('display.unicode.east_asian_width', True)

# 데이터프레임 출력
display(df)